---

C#Visual BasicVisual C++

Revit 2024 API
---
Reference..::..CreateLinkReference Method
Reference Class See Also Send Feedback
---

Creates a Reference from a Reference in an RVT Link.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014

# Syntax

C#
---

    public Reference CreateLinkReference(
    	RevitLinkInstance revitLinkInstance
    )

Visual Basic
---

    Public Function CreateLinkReference ( _
    	revitLinkInstance As RevitLinkInstance _
    ) As Reference

Visual C++
---

    public:
    Reference^ CreateLinkReference(
    	RevitLinkInstance^ revitLinkInstance
    )

#### Parameters

revitLinkInstance
    Type: Autodesk.Revit.DB..::..RevitLinkInstanceId of the RevitLinkInstance that contains the reference.

# Remarks

The reference that is returned can be used to create a family instance on a face in an RVT link.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when revitLinkInstance is nullNothingnullptra null reference (Nothing in Visual Basic). |

# See Also

Reference Class

Autodesk.Revit.DB Namespace